app/controllers/travel_controller.rb

SELECT  "travels".* FROM "travels"  WHERE "travels"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @travel = Travel.find(params[:id])